'''โปรแกรมเพื่อสลับลำดับพีชคณิต กำหนดให้รับค่าตัวเลข x, y, z, และ c โดยที่

x เป็นจำนวนมากที่สุดของตำแหน่ง x โดยเริ่มจาก 0
y เป็นจำนวนมากที่สุดของตำแหน่ง y โดยเริ่มจาก 0
z เป็นจำนวนมากที่สุดของตำแหน่ง z โดยเริ่มจาก 0
c ผลรวมของตำแหน่ง (x, y, z) จะต้องไม่เท่ากับ c
กำหนดให้ x=1, y=1, z=2, c=3 ลำดับพีชคณิตที่เป็นไปได้ คือ [0, 0, 0] [0, 0, 1] [0, 0, 2] [0, 1, 0] [0, 1, 1] [0, 1, 2] [1, 0, 0] [1, 0, 1] [1, 0, 2] [1, 1, 0] [1, 1, 1] [1, 1, 2] ลำดับที่ผลรวมไม่เท่ากับ c คือ [0, 0, 0] [0, 0, 1] [0, 0, 2] [0, 1, 0] [0, 1, 1] [1, 0, 0] [1, 0, 1] [1, 1, 0] [1, 1, 2]

ตัวอย่างโปรแกรม
x = 1
y = 1
z = 2
c = 3
=> [[0, 0, 0], [0, 0, 1], [0, 0, 2], [0, 1, 0], [0, 1, 1], [1, 0, 0], [1, 0, 1], [1, 1, 0], [1, 1, 2]]
ตัวอย่างโปรแกรม
x = 1
y = 1
z = 1
c = 2
=> [[0, 0, 0], [0, 0, 1], [0, 1, 0], [1, 0, 0], [1, 1, 1]]'''





user_input_x = int(input("x = ")) # รับ input x จากผู้ใช้งานเป็นตัวเลขจำนวนเต็ม
user_input_y = int(input("y = ")) # รับ input y จากผู้ใช้งานเป็นตัวเลขจำนวนเต็ม
user_input_z = int(input("z = ")) # รับ input z จากผู้ใช้งานเป็นตัวเลขจำนวนเต็ม
user_input_c = int(input("c = ")) # รับ input c จากผู้ใช้งานเป็นตัวเลขจำนวนเต็ม
result = [] # ข้อมูลในเป็น list ใน result
for x in range(user_input_x +1) :
    for y in range(user_input_y +1) :
        for z in range(user_input_z +1) :
            if x + y + z != user_input_c: # ใช้เพื่อ check  x + y + z ว่าไม่เท่ากับ user_input_c 
                
                result.append([x, y, z]) # หากเป็นไปตามเงื่อนไขของ if โปรแกรมจะนำข้อมูล [x, y, z]
                                         # ที่ได้จากการ for loop เพิ่มใน list ของ result

print("=>", result) # เมื่อเสร็จการทำงานโปรแกรมจะแสดงผลข้อมูลที่อยู่ใน list ของ result